{"config": [{"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "data_format": "channels_last", "dtype": "float32", "activation": "sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": true, "filters": 32, "padding": "same", "kernel_regularizer": null, "trainable": true, "kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_1", "batch_input_shape": [null, 255, 255, 3], "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "data_format": "channels_last", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": true, "filters": 32, "padding": "valid", "trainable": true, "kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_2", "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "data_format": "channels_last", "name": "max_pooling2d_1", "pool_size": [2, 2], "strides": [2, 2], "padding": "valid"}}, {"class_name": "Dropout", "config": {"trainable": true, "noise_shape": null, "name": "dropout_1", "seed": null, "rate": 0.25}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "data_format": "channels_last", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": true, "filters": 16, "padding": "same", "trainable": true, "kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_3", "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "data_format": "channels_last", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": true, "filters": 16, "padding": "valid", "trainable": true, "kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_4", "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "data_format": "channels_last", "name": "max_pooling2d_2", "pool_size": [2, 2], "strides": [2, 2], "padding": "valid"}}, {"class_name": "Dropout", "config": {"trainable": true, "noise_shape": null, "name": "dropout_2", "seed": null, "rate": 0.25}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "data_format": "channels_last", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": true, "filters": 16, "padding": "same", "trainable": true, "kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_5", "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "data_format": "channels_last", "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "use_bias": true, "filters": 16, "padding": "valid", "trainable": true, "kernel_size": [3, 3], "kernel_constraint": null, "name": "conv2d_6", "kernel_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "data_format": "channels_last", "name": "max_pooling2d_3", "pool_size": [2, 2], "strides": [2, 2], "padding": "valid"}}, {"class_name": "Dropout", "config": {"trainable": true, "noise_shape": null, "name": "dropout_3", "seed": null, "rate": 0.25}}, {"class_name": "Flatten", "config": {"trainable": true, "data_format": "channels_last", "name": "flatten_1"}}, {"class_name": "Dense", "config": {"units": 128, "activation": "relu", "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"units": 8, "activation": "softmax", "kernel_regularizer": null, "use_bias": true, "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "keras_version": "2.1.6", "backend": "tensorflow", "class_name": "Sequential"}