{"keras_version": "2.1.6", "backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "batch_input_shape": [null, 255, 255, 3], "kernel_constraint": null, "name": "conv2d_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "padding": "same", "strides": [1, 1], "dtype": "float32", "dilation_rate": [1, 1], "filters": 32, "kernel_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "activation": "sigmoid"}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "padding": "valid", "kernel_constraint": null, "name": "conv2d_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "dilation_rate": [1, 1], "filters": 32, "kernel_regularizer": null, "use_bias": true, "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_1", "trainable": true, "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_1", "noise_shape": null, "trainable": true, "rate": 0.25}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "padding": "same", "kernel_constraint": null, "name": "conv2d_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "dilation_rate": [1, 1], "filters": 16, "kernel_regularizer": null, "use_bias": true, "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "activation": "relu"}}, {"class_name": "Conv2D", "config": {"kernel_size": [3, 3], "padding": "valid", "kernel_constraint": null, "name": "conv2d_4", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "dilation_rate": [1, 1], "filters": 16, "kernel_regularizer": null, "use_bias": true, "strides": [1, 1], "activity_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "pool_size": [2, 2], "name": "max_pooling2d_2", "trainable": true, "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_2", "noise_shape": null, "trainable": true, "rate": 0.25}}, {"class_name": "Flatten", "config": {"data_format": "channels_last", "name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "units": 128, "use_bias": true, "activation": "relu", "bias_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_constraint": null, "name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "units": 8, "use_bias": true, "activation": "softmax", "bias_regularizer": null}}]}